In [2]:
import pandas as pd
import numpy as np

In [3]:
df_csv = pd.read_csv("orders.csv")
df_csv.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [5]:
df_json = pd.read_json("users.json", orient = "records")

In [6]:
import sqlite3
conn = sqlite3.connect("restaurants.db")
with open("restaurants.sql") as f:
    sql_script = f.read()
conn.executescript(sql_script)

In [8]:
restaurants = pd.read_sql_query("SELECT * FROM restaurants",conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [10]:
orders_users_df = pd.merge(
    df_csv,
    df_json,
    on="user_id",
    how = "left"
)
orders_users_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [12]:
final_df = pd.merge(
    orders_users_df,
    restaurants,
    on = "restaurant_id",
    how = "left"
)
final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [13]:
final_df.shape

(10000, 12)

In [14]:
final_df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

In [15]:
final_df = final_df.drop(columns=["restaurants_name_y"],errors = "ignore")
final_df = final_df.rename(columns={"restaurants_name_x":"rstaurant_name"})

In [16]:
final_df.to_csv("final_food_delivery_dataset.csv",index = False)

In [17]:
import os
os.listdir()

['.ipynb_checkpoints',
 'final_food_delivery_dataset.csv',
 'inno.ipynb',
 'orders.csv',
 'restaurants.db',
 'restaurants.sql',
 'users.json']

In [18]:
pd.read_csv("final_food_delivery_dataset.csv")

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Restaurant_249,Italian,4.7
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Restaurant_267,Chinese,4.2
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Restaurant_420,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Restaurant_492,Italian,4.0
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Restaurant_439,Mexican,3.1

In [22]:
gold_city_revenue = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

gold_city_revenue

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [39]:
import pandas as pd

df = pd.read_csv("final_food_delivery_dataset.csv")

df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,4/10/2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [40]:
df.groupby('cuisine')['total_amount'] \
  .mean() \
  .sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [41]:
user_total = df.groupby('user_id')['total_amount'].sum()

In [42]:
high_value_users = user_total[user_total > 1000]

In [43]:
high_value_users.count()

np.int64(2544)

In [47]:
df.groupby("rating_range", observed=False)["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

rating_range
4.6–5.0    2197030.75
3.0–3.5    2136772.70
4.1–4.5    1960326.26
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [48]:
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .mean() \
  .sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [49]:
df.groupby("cuisine")["restaurant_id"].nunique() \
  .sort_values()

cuisine
Chinese    120
Indian     126
Italian    126
Mexican    128
Name: restaurant_id, dtype: int64

In [50]:
gold_orders = df[df["membership"] == "Gold"].shape[0]
total_orders = df.shape[0]

round((gold_orders / total_orders) * 100)

50

In [75]:
options = [
    "Grand Cafe Punjabi",
    "Grand Restaurant South India",
    "Ruchi Mess Multicuisine",
    "Ruchi Foods Chinese"
]

q8 = (
    final_df[final_df["restaurant_name_x"].isin(options)]
    .groupby("restaurant_name_x")
    .agg(
        avg_order=("total_amount", "mean"),
        order_count=("order_id", "count")
    )
    .query("order_count < 20")
    .sort_values("avg_order", ascending=False)
    .head(1)
)

q8

                      avg_order  order_count
restaurant_name_x
Ruchi Foods Chinese  686.603158           19

In [57]:
combo_revenue = (
    final_df.groupby(["membership", "cuisine"])["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

combo_revenue

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [66]:
final_df["order_date"] = pd.to_datetime(final_df["order_date"], dayfirst=True)

In [67]:
final_df["quarter"] = final_df["order_date"].dt.to_period("Q")

In [68]:
quarter_revenue = (
    final_df.groupby("quarter")["total_amount"]
            .sum()
)

quarter_revenue

quarter
2023Q1    1993425.14
2023Q2    1945348.72
2023Q3    2037385.10
2023Q4    2018263.66
2024Q1      17201.50
Freq: Q-DEC, Name: total_amount, dtype: float64

In [71]:
import pandas as pd

final_df = pd.read_csv("final_food_delivery_dataset.csv")

In [72]:
gold_orders = final_df[final_df["membership"] == "Gold"].shape[0]
gold_orders

4987

In [73]:
hyderabad_revenue = round(
    final_df[final_df["city"] == "Hyderabad"]["total_amount"].sum()
)
hyderabad_revenue

1889367

In [76]:
distinct_users = final_df["user_id"].nunique()
distinct_users

2883

In [77]:
avg_gold_order_value = round(
    final_df[final_df["membership"] == "Gold"]["total_amount"].mean(), 2
)
avg_gold_order_value

np.float64(797.15)

In [78]:
high_rating_orders = final_df[final_df["rating"] >= 4.5].shape[0]
high_rating_orders

3374

In [79]:
# Find top revenue city among Gold members
top_gold_city = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .idxmax()
)

# Count orders in that city by Gold members
orders_top_city = final_df[
    (final_df["membership"] == "Gold") &
    (final_df["city"] == top_gold_city)
].shape[0]

top_gold_city, orders_top_city

('Chennai', 1337)